; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	spectrograph0 - mode
	thermograph6 - mode
	spectrograph1 - mode
	infrared3 - mode
	image2 - mode
	infrared5 - mode
	image4 - mode
	GroundStation6 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation5 - direction
	Star0 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared5)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 spectrograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared5)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image2)
	(supports instrument4 infrared5)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument5 thermograph6)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star0)
	(supports instrument6 thermograph6)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
	(supports instrument7 infrared5)
	(supports instrument7 spectrograph1)
	(supports instrument7 image4)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 Star3)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
	(supports instrument8 spectrograph1)
	(supports instrument8 infrared3)
	(supports instrument8 image4)
	(calibration_target instrument8 Star0)
	(supports instrument9 thermograph6)
	(calibration_target instrument9 Star0)
	(calibration_target instrument9 GroundStation5)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation6)
)
(:goal (and
	(pointing satellite3 Planet11)
	(pointing satellite5 Star3)
	(have_image Planet7 thermograph6)
	(have_image Star8 spectrograph0)
	(have_image Star8 spectrograph1)
	(have_image Phenomenon9 infrared5)
	(have_image Phenomenon9 infrared3)
	(have_image Planet10 spectrograph0)
	(have_image Planet10 infrared5)
	(have_image Planet11 thermograph6)
	(have_image Planet11 spectrograph0)
))

)

; plan
1. (turn_to satellite3 star0 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star0)
   goals met: 0 of 11
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 11
3. (calibrate satellite3 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 0 of 11
4. (turn_to satellite3 planet7 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 planet7)
   goals met: 0 of 11
5. (take_image satellite3 planet7 instrument5 thermograph6)
   added: (have_image planet7 thermograph6)
   goals met: 1 of 11
6. (turn_to satellite3 planet11 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 planet11)
   goals met: 2 of 11
7. (turn_to satellite2 groundstation4 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 groundstation4)
   goals met: 2 of 11
8. (turn_to satellite0 groundstation2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation2)
   goals met: 2 of 11
9. (take_image satellite3 planet11 instrument5 thermograph6)
   added: (have_image planet11 thermograph6)
   goals met: 3 of 11
10. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 3 of 11
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 11
12. (calibrate satellite2 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 3 of 11
13. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 3 of 11
14. (turn_to satellite0 phenomenon9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 11
15. (take_image satellite0 phenomenon9 instrument0 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 4 of 11
16. (take_image satellite0 phenomenon9 instrument0 infrared5)
   added: (have_image phenomenon9 infrared5)
   goals met: 5 of 11
17. (turn_to satellite0 star8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star8)
   goals met: 5 of 11
18. (take_image satellite0 star8 instrument0 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 6 of 11
19. (turn_to satellite2 planet10 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 planet10)
   goals met: 6 of 11
20. (take_image satellite2 planet10 instrument3 infrared5)
   added: (have_image planet10 infrared5)
   goals met: 7 of 11
21. (take_image satellite2 planet10 instrument3 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 8 of 11
22. (turn_to satellite2 planet11 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet11)
   goals met: 8 of 11
23. (take_image satellite2 planet11 instrument3 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 9 of 11
24. (turn_to satellite2 star8 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star8)
   goals met: 9 of 11
25. (take_image satellite2 star8 instrument3 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 10 of 11
26. (turn_to satellite5 star3 groundstation6)
   deleted: (pointing satellite5 groundstation6)
   added: (pointing satellite5 star3)
   goals met: 11 of 11
